{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> 2-Faktor-Authentisierung","text":"","tags":"","url":"index.html"},{"title":"Changelog","text":"Unreleased 1.0.0.0 2018-10-24 - #1000 Added 2-Faktor-Authentisierung für Backend-Logins zusätzlich zu Benutzername und Passwort Authentisierung wird nur bei Benutzerkonten gezeigt, die dieses aktiviert haben - sonst nur Standardanmeldung die Basis der Passwortgenerierung wird für jedes Benutzerkonto individuell angelegt Einrichtung des Zugangs in der Auth-App kann durch scanbaren QR-Code oder kopierbare Zeichenkette erfolgen Validierung der Einmalpassworte und Generierung der QR-Codes werden ausschließlich innerhalb des Shops durchgeführt - keine Kommunikation nach außen nötig","tags":"","url":"changelog\/Changelog.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/index.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis 7.2.x PHP Decoder installierter ionCube Loader Shopversionen \/ -editionen OXID eShop Community Edition in Compilation Version 6.0.x 6.1.x OXID eShop Professional Edition in Compilation Version 6.0.x 6.1.x oder OXID eShop Enterprise Edition in Compilation Version 6.0.x 6.1.x Installation via Composer Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 5.6, PHP 7.0, PHP 7.1 oder PHP 7.2 kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Community Edition (CE), Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist. optional: Modul-Connector (kostenfrei bei erhältlich) ab Version 5.1.1.4 Ist der Modul-Connector installiert, können Datenbankänderungen über die automatische Installation eingerichtet und überwacht werden.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Anforderungsprüfung","text":"Im Ordner docs finden Sie den Ordner Precheck. Mit dessen Inhalt können Sie die Mindestanforderungen auf Ihrem Server direkt prüfen. Kopieren Sie die enthaltenen Dateien und Ordner unverändert in das source-Verzeichnis Ihres installierten OXID-Shops. Rufen Sie nun über Ihren Browser die folgende Adresse auf: http:\/\/www.ihreadresse.de\/d3precheck.php Ihnen werden nun Details und Ergebnisse zur Anforderungsprüfung angezeigt. Löschen Sie diese Scripte mit Hilfe der in der Übersicht enthaltenen Funktion bitte unbedingt nach der Prüfung wieder von Ihrem Server.","tags":"","url":"installation\/Anforderungen\/Anforderungspruefung.html"},{"title":"Schnellstart per Composer","text":"Schnellstart per Composer php composer config repositories.d3 composer https:\/\/satis.oxidmodule.com php composer require d3\/totp –-update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Schritten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Paketquelle hinzufügen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Senden Sie dort diesen Befehl ab: php composer config repositories.d3 composer https:\/\/satis.oxidmodule.com Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Paketquelle_hinzufuegen.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im selben Verzeichnis diesen Befehl aus, um das Modul 2-Faktor-Authentisierung zur Installation hinzuzufügen: php composer require d3\/totp --update-no-dev Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von 2-Faktor-Authentisierung auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"mit installiertem Modul-Connector Wenn der Modul-Connector installiert ist, startet direkt nach der Modulaktivierung der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. ohne installiertem Modul-Connector Führen Sie bitte die Anweisungen in der Datei install.sql im docs-Ordner in Ihrer Datenbank aus.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Updatefähigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von 2-Faktor-Authentisierung auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie dort diesen Befehl aus: php composer update d3\/totp --no-dev Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von 2-Faktor-Authentisierung auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installierren","text":"mit installiertem Modul-Connector Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen. ohne installiertem Modul-Connector Prüfen Sie bitte, ob in der Datei &quot;update.sql&quot; im docs-Ordner Änderungen hinterlegt sind, die in der Datenbank ausgeführt werden sollten.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Erweiterungen anpassen","text":"Haben Sie für dieses Modul eigene Erweiterung entwickelt, gleichen Sie dies bitte mit der neuen Fassung des Moduls ab.","tags":"","url":"installation\/Update\/Erweiterungen_anpassen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende(n) Checkliste(n) verwenden: Einstellungsunabhängige Prüfungen Backend Modul ist unter Erweiterungen -&gt; Module aktiv geschaltet Modul zeigt unter Benutzer verwalten -&gt; Benutzer -&gt; 2-Faktor-Authentisierung einen eigenen Bereich für Einstellungen Einstellungsabhängige Prüfungen Backend Nach Aktivierung fragt das Backend neben Benutzername und Passwort auch ein Einmalpasswort ab.","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Aktivieren Sie die 2-Faktor-Authentisierung im Backend unter Benutzer verwalten -&gt; Benutzer -&gt; 2-Faktor-Authentisierung. Ab dann erfordert das Login im Backend für das jeweilige Benutzerkonto neben Benutzername auch die Angabe eines Einmalpasswortes. Diese zusätzliche Absicherung kann im Adminbereich jederzeit wieder entfernt werden. zusätzliche Konfigurationsparameter in der Datei config.inc.php möglich: blDisableTotpGlobally =&gt; true: deaktiviert diese zusätzlichen Sicherung shopweit für alle Benutzer. Diese Option ist für den Fall vorbehalten, wenn der Adminbereich aus einem technischen Grund und von diesem Modul verursacht nicht mehr aufgerufen werden kann.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul 2-Faktor-Authentisierung aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul 2-Faktor-Authentisierung über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von 2-Faktor-Authentisierung auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/totp --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner totp und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"Das Modul legt Informationen in der Datenbank ab. Sofern diese Daten nicht mehr benötigt werden, können diese gelöscht werden. Legen Sie sich vorab bitte unbedingt eine Sicherung an, um die Daten im Zweifelsfall wiederherstellen zu können. Für das Modul 2-Faktor-Authentisierung sind dies die folgende Tabellen und Felder: die komplette Tabelle d3totp","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserer Modul-FAQ zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr -Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}